app/controllers/articles_controller.rb

    def index
        @articles = Article.select(:id, :title, :author, :body, :created_at)
---
SELECT "articles"."id", "articles"."title", "articles"."author", "articles"."body", "articles"."created_at" FROM "articles"

    def create
        @article = Article.new(permitted_params)
        if !@article.errors.any?
            @article.save
---
INSERT INTO "articles" ("title", "author", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "article 1"], ["author", "areej"], ["body", "dcn hrbnklvmoionoer"], ["created_at", "2023-11-15 21:54:41.276980"], ["updated_at", "2023-11-15 21:54:41.276980"]]

    def update
        if @article.update(permitted_params)
---
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "this article is edited"], ["updated_at", "2023-11-15 21:56:35.523179"], ["id", 1]]

    def get_article
        @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]