app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commentor", "article_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commentor", nil], ["article_id", 1], ["body", "nbhgvcfdtxerdytfuygiuo"], ["created_at", "2023-11-15 23:48:58.995747"], ["updated_at", "2023-11-15 23:48:58.995747"]]
---
    def create
        @article = Article.find(params[:article_id])
        @comment = @article&.comments.create(permitted_params)